cls
@echo off
::最小化执行
%1(start /min cmd.exe /c %0 :&exit)
echo 开始清理7天前的备份文件
echo 本次清理的文件
forfiles /p D:\orcel_bak /s /m *.* /d -6 /c "cmd /c echo [@file]"
echo 清理完成
echo **************************************************************************************************
echo **************************************************************************************************
echo 开始备份数据库BPM
exp BPM/!QAZ2wsx file=D:\orcel_bak\BPM%date:~5,2%%date:~8,2%.dmp log=D:\orcel_bak\BPM_bak%date:~5,2%%date:~8,2%.log
echo 数据库BPM备份完成
echo **************************************************************************************************
echo **************************************************************************************************
echo 开始备份数据库BSP
exp BSP/!QAZ2wsx file=D:\orcel_bak\BSP%date:~5,2%%date:~8,2%.dmp log=D:\orcel_bak\BSP_bak%date:~5,2%%date:~8,2%.log
echo 数据库BSP备份完成
echo **************************************************************************************************
echo **************************************************************************************************
echo 开始备份数据库DISK
exp DISK/!QAZ2wsx file=D:\orcel_bak\DISK%date:~5,2%%date:~8,2%.dmp log=D:\orcel_bak\DISK_bak%date:~5,2%%date:~8,2%.log
echo 数据库DISK备份完成
echo **************************************************************************************************
echo **************************************************************************************************
echo 开始备份数据库DTGL
exp DTGL/!QAZ2wsx file=D:\orcel_bak\DTGL%date:~5,2%%date:~8,2%.dmp log=D:\orcel_bak\DTGL_bak%date:~5,2%%date:~8,2%.log
echo 数据库DTGL备份完成
echo **************************************************************************************************
echo **************************************************************************************************
echo 开始备份数据库FORM
exp FORM/!QAZ2wsx file=D:\orcel_bak\FORM%date:~5,2%%date:~8,2%.dmp log=D:\orcel_bak\FORM_bak%date:~5,2%%date:~8,2%.log
echo 数据库FORM备份完成
echo **************************************************************************************************
echo **************************************************************************************************
echo 开始备份数据库IPF
exp IPF/!QAZ2wsx file=D:\orcel_bak\IPF%date:~5,2%%date:~8,2%.dmp log=D:\orcel_bak\IPF_bak%date:~5,2%%date:~8,2%.log
echo 数据库IPF备份完成
echo **************************************************************************************************
echo **************************************************************************************************
echo 开始备份数据库YDD
exp YDD/!QAZ2wsx file=D:\orcel_bak\YDD%date:~5,2%%date:~8,2%.dmp log=D:\orcel_bak\YDD_bak%date:~5,2%%date:~8,2%.log
echo 数据库YDD备份完成
echo **************************************************************************************************
echo **************************************************************************************************
echo 备份完成
pause